# GridLines

## Description
Procedure GridLines sets the distance between the drawing grid lines in the document.

```pascal
PROCEDURE GridLines(gridDistance : REAL);
```

```python
def vs.GridLines(gridDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|gridDistance|REAL|Grid spacing distance.|

## Examples
```pascal
GridLines(1.0);
```
```python
import vs

# Procedure GridLines sets the distance between the drawing grid lines in the
# document.
gridDistance = 1.0

vs.GridLines(gridDistance)
```

## Version
Availability: from All Versions

## Category
* Document Settings